mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE985x_DFP.1.1.4.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <license>Licence/CMSIS_END_USER_LICENCE_AGREEMENT.txt</license>  
  <vendor>Infineon</vendor>
  <url>https://www.infineon.com/cmsis_packs/TLE985x/</url>
  <name>TLE985x_DFP</name>
  <description>Infineon TLE985x Series Device Support</description>
  <supportContact>http://www.infineon.com/support</supportContact>
  
  <releases>
    <release version="1.1.4" date="2019-07-03">
      Added DC motor example for TLE9855 EvalKit
      CCU6: CCU6 registers displayed correctly in debugger
      UART: Corrected ranges for UART1_BaudRate_Set and UART2_BaudRate_Set
      SCU: Removed unused initialization of SCU->MODPISEL3,
      Set LIN to sleep mode only if the LIN module is enabled
      BDRV: Set APCLK_SET after modifying SCU->BRDRV_CLK.reg to apply clock changes,
      Corrected value of define BDRV_IRQ_CLR_BITS to clear all interrupts 
      ADC1: Removed initialization of ADC1_CAL_CHx_y in ADC1_Init as these registers are initialized by the BootROM
    </release>
    <release version="1.1.2" date="2019-04-01">
      Firmware user manual added
      scu: added open/close password where necessary
      adaption to new PACK deployment process
    </release>
    <release version="1.1.0" date="2019-03-20">
      SDK Unit tested
      MISRA 2012 compliant
      ARMCC v6 support
    </release>
    <release version="1.0.2" date="2018-10-09">
      XML update
      ADC1 update
    </release>
    <release version="1.0.1" date="2018-09-28">
      TLE985x Device Family Pack.
      BDRV Motor Control Example added.
      Flash Programing Examples added.
      Improved GUI for Config Wizard.
      Bug fixes.
    </release>
    <release version="1.0.0" date="2018-07-05">
      TLE985x Device Family Pack.
      Full SDK including examples.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Infineon</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Infineon</keyword>
    <keyword>TLE98</keyword>
    <keyword>TLE985x</keyword>
  </keywords>

  <devices>
    <family Dfamily="TLE98xx Series" Dvendor="Infineon:7">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian"/>
      <description>
        The TLE985x series is designed for motor drive applications with LIN/PWM interface
        - 32-bit ARM Cortex-M0 Core
        - Ultra low power consumption
        - Nested Vectored Interrupt Controller (NVIC)
        - Integrated LIN tranceiver (selected derivates)
        - Integrated MOSFET Driver and Charge Pump for H-Bridge
        - Current Sense Amplifier
      </description>
      <environment name="uv">
      </environment>

      <feature type="WDT"           n="1"/>
      <feature type="ComOther"      n="2"                           name="Universal Serial Interface"/>
      <feature type="Temp"          n="-40"     m="150"             name="all Devices"/>

      <subFamily DsubFamily="TLE985x Series">
          <device Dname="TLE9851QXW">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle985x.h" define="TLE9851QXW"/>
            <debug      svd="SVD/TLE985x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0x10000"    startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x10FFFFFC"  size="0x4"        startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE985x_OPT.FLM"    start="0x10FFFFFC"  size="0x4"                      default="1"/>
            <algorithm  name="Flash/TLE9851.FLM"        start="0x11000000"  size="0xF000"                   default="1"/>
            <algorithm  name="Flash/TLE9851_EEP.FLM"    start="0x1100F000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE985xQX-Users-Manual-10-Infineon.pdf"        title="TLE985x Series Reference Manual"/>
            <book    name="Documents/TLE985xQX-BootROM-User-Manual-10-Infineon.pdf" title="TLE985x Series BootROM Manual"/>
            <!--book    name="Documents/TLE9851QXW-Data-Sheet-10-Infineon.pdf"         title="TLE9851QXW Data Sheet"/-->
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>

          <device Dname="TLE9853QX">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle985x.h" define="TLE9853QX"/>
            <debug      svd="SVD/TLE985x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0xC000"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x10FFFFFC"  size="0x4"        startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE985x_OPT.FLM"    start="0x10FFFFFC"  size="0x4"                      default="1"/>
            <algorithm  name="Flash/TLE9853.FLM"        start="0x11000000"  size="0xB000"                   default="1"/>
            <algorithm  name="Flash/TLE9853_EEP.FLM"    start="0x1100B000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE985xQX-Users-Manual-10-Infineon.pdf"        title="TLE985x Series Reference Manual"/>
            <book    name="Documents/TLE985xQX-BootROM-User-Manual-10-Infineon.pdf" title="TLE985x Series BootROM Manual"/>
            <!--book    name="Documents/TLE9853QX-Data-Sheet-10-Infineon.pdf"          title="TLE9853QX Data Sheet"/-->
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>

