mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE985x_DFP.1.1.4.pdsc
   <boards>
    <board vendor="Infineon" name="TLE985X EvalBoard" revision="V1.0" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE985x Evaluation Board Support and Examples</description>
      <image small="Images/TLE985x_EvalBoard_v1_0_top_small.jpg" large="Images/TLE985x_EvalBoard_v1_0_top_large.jpg"/>
      <!--book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE9879+EVALKIT/evaluation-boards/TLE9879+EVALKIT/productType.html?productType=5546d4624e765da5014eb4e2cc3f2fc5" title="TLE9879 EvalKit Web Page"/-->
      <!--book category="setup"     name="Documents/TLE9879-EvalKit-UM-110-Infineon.pdf" title="Getting Started"/-->
      <book category="schematic" name="Documents/TLE985x_EvalBoard_v1_0.zip" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9855QX"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE985x Series"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
    
    <board vendor="Infineon" name="TLE9855 EvalKit" revision="V1.1" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE9855 Evaluation Kit Support and Examples</description>
      <image small="Images/TLE985x_EvalKit_v1_1_top_small.jpg" large="Images/TLE985x_EvalKit_v1_1_top_large.jpg"/>
      <!--book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE9879+EVALKIT/evaluation-boards/TLE9879+EVALKIT/productType.html?productType=5546d4624e765da5014eb4e2cc3f2fc5" title="TLE9879 EvalKit Web Page"/-->
      <!--book category="setup"     name="Documents/TLE9879-EvalKit-UM-110-Infineon.pdf" title="Getting Started"/-->
      <book category="schematic" name="Documents/TLE9855_EvalKit_v1_1.zip" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9855QX"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="TLE985x CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon TLE985x device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/Include/"/>
        
        <!-- startup files -->
        <file category="source"  name="Device/Source/ARM/startup_tle985x.S" attr="config" condition="TLE985x" version="0.1.0"/>

        <!-- system file -->
        <file category="source"  name="Device/Source/system_tle985x.c"      attr="config" condition="TLE985x" version="0.1.1"/>
        <file category="header"  name="Device/Include/system_tle985x.h"     attr="config" condition="TLE985x" version="0.1.1"/>

        <file category="source"  name="Device/Source/tle_device.c"          attr="config" condition="TLE985x" version="0.1.1"/>
        <file category="header"  name="Device/Include/tle_device.h"         attr="config" condition="TLE985x" version="0.1.1"/>
        <file category="header"  name="Device/Include/tle_variants.h"       attr="config" condition="TLE985x" version="0.1.0"/>

        <file category="header"  name="Device/Include/types.h"              attr="config" condition="TLE985x" version="0.3.2"/>
        <file category="source"  name="Device/Include/sfr_access.h"         attr="config" condition="TLE985x" version="0.1.0"/>
        <file category="header"  name="Device/Include/cmsis_misra.h"        attr="config" condition="TLE985x" version="0.1.0"/>

        <file category="header"  name="Device/Include/tle985x.h"            attr="config" condition="TLE985x" version="1.0.0"/>
        <file category="sourceC" name="Device/SDK/app/main.c"               attr="template" select="Simple Main" condition="TLE985x" version="1.0.0"/>         
        <file category="doc"     name="Documents/html/index.html"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="ConfigWizard_v2" Cversion="2.1.12" condition="TLE985x">
     <description>Infineon Config Wizard v2 support</description>
     <files>
        <file category="doc" name="Device/SDK/cfgwiz/config.icwp"            attr="config" condition="TLE985x" version="0.0.0"/>
        <file category="doc" name="Device/SDK/cfgwiz/script/ICW_TLE985x.xml" attr="config" condition="TLE985x" version="1.0.1"/>
        <file category="doc" name="Device/SDK/cfgwiz/script/TLE985x.mig"     attr="config" condition="TLE985x" version="0.1.0"/>
        <file category="doc" name="SVD/TLE985x.svd"                          attr="config" condition="TLE985x" version="1.1.0"/>

        <file category="header" name="Device/SDK/cfgwiz/bsl_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/scu_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/int_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/isr_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/lin_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/port_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/pmu_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/adc1_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/adc2_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/bdrv_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/ccu6_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/csa_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/gpt12e_defines.h"  attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/mon_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/ssc_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/timer2x_defines.h" attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/uart_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/math_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/hs_defines.h"      attr="config" version="0.0.0"/>      
     </files>
    </component>

