mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE985x_DFP.1.1.4.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="CSA" Cversion="0.2.1" condition="TLE985x CMSIS Device">
      <description>Current Sense Amplifier (CSA) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_CSA
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/csa.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/csa.c" version="0.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" Cversion="0.2.1" condition="TLE985x CMSIS Device">
      <description>General Purpose Timer 12E (GPT12E) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_GPT12E
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/gpt12e.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/gpt12e.c" version="0.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="MON" Cversion="0.2.2" condition="TLE985x CMSIS Device">
      <description>High Voltage Monitor Input (MON) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_MON
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/mon.h" version="0.2.2"/>
        <file category="source" attr="config" name="Device/SDK/src/mon.c" version="0.2.2"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SSC" Cversion="0.2.1" condition="TLE985x CMSIS Device">
      <description>High Speed Synchronous Serial Interface 1 and 2 (SSC) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SSC
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/ssc.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/ssc.c" version="0.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" Cversion="0.2.1" condition="TLE985x CMSIS Device">
      <description>Timer2 and Timer21 (TIMER2x) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER2X
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/timer2x.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/timer2x.c" version="0.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="UART" Cversion="0.2.3" condition="TLE985x CMSIS Device">
      <description>UART1 and UART2 (UART) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_UART
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/uart.h" version="0.2.3"/>
        <file category="source" attr="config" name="Device/SDK/src/uart.c" version="0.2.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="MATHDIV" Cversion="0.2.2" condition="TLE985x CMSIS Device">
      <description>Math driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_MATH
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/mathdiv.h" version="0.2.2"/>
        <file category="source" attr="config" name="Device/SDK/src/mathdiv.c" version="0.2.2"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="HS" Cversion="0.2.2" condition="TLE985x CMSIS Device">
      <description>High Side Switch driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_HS
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/hs.h" version="0.2.2"/>
        <file category="source" attr="config" name="Device/SDK/src/hs.c" version="0.2.2"/>
      </files>
    </component>

  </components>
  <examples>
    <example name="PMU_POWER_SAVING_SLEEP_MODE" doc="Abstract.txt" folder="Boards/Infineon/TLE985x_EvalBoard/POWER_SAVING_SLEEP_MODE_EXAMPLE_TLE985X/">
      <description>Power Saving Modes - Sleep Mode</description>
      <board name="TLE985X EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="POWER_SAVING_SLEEP_MODE_EXAMPLE_TLE985X.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="MON"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="BLINKY" doc="Abstract.txt" folder="Boards/Infineon/TLE985x_EvalBoard/BLINKY_EXAMPLE_TLE985X/">
      <description>Blinky - blinks LED1</description>
      <board name="TLE985X EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="BLINKY_EXAMPLE_TLE985X.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
        <component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
        <component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
        <component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
        <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="SDK" Csub="INT"/>

        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

